#+OPTIONS: toc:nil 
#+TITLE: Nanopore Reads Analysis
**** Checking current fast5 format
     #+BEGIN_SRC python :results output
       import h5py
       #Example f5 file
       f5 = h5py.File('/run/media/christophe/Elements/ONT Data sets/downloads 121115 AMPLICONS LIGATED/'+
                      'pass/FW01C250_AMPLICONS_LIGATED_121115A_2348_1_ch71_file70_strand.fast5')
       #Walk the file structure
       def printname(name):
           print(name,'(group)' if type(f5[name]) == h5py._hl.group.Group else '')

       f5.visit(printname)
     #+END_SRC

     #+RESULTS:
     #+begin_example
     Analyses (group)
     Analyses/Basecall_1D_000 (group)
     Analyses/Basecall_1D_000/BaseCalled_complement (group)
     Analyses/Basecall_1D_000/BaseCalled_complement/Events 
     Analyses/Basecall_1D_000/BaseCalled_complement/Fastq 
     Analyses/Basecall_1D_000/BaseCalled_complement/Model 
     Analyses/Basecall_1D_000/BaseCalled_template (group)
     Analyses/Basecall_1D_000/BaseCalled_template/Events 
     Analyses/Basecall_1D_000/BaseCalled_template/Fastq 
     Analyses/Basecall_1D_000/BaseCalled_template/Model 
     Analyses/Basecall_1D_000/Configuration (group)
     Analyses/Basecall_1D_000/Configuration/aggregator (group)
     Analyses/Basecall_1D_000/Configuration/basecall_1d (group)
     Analyses/Basecall_1D_000/Configuration/basecall_2d (group)
     Analyses/Basecall_1D_000/Configuration/calibration_strand (group)
     Analyses/Basecall_1D_000/Configuration/components (group)
     Analyses/Basecall_1D_000/Configuration/general (group)
     Analyses/Basecall_1D_000/Configuration/hairpin_align (group)
     Analyses/Basecall_1D_000/Configuration/post_processing (group)
     Analyses/Basecall_1D_000/Configuration/post_processing.3000Hz (group)
     Analyses/Basecall_1D_000/Configuration/split_hairpin (group)
     Analyses/Basecall_1D_000/Log 
     Analyses/Basecall_1D_000/Summary (group)
     Analyses/Basecall_1D_000/Summary/basecall_1d_complement (group)
     Analyses/Basecall_1D_000/Summary/basecall_1d_template (group)
     Analyses/Basecall_2D_000 (group)
     Analyses/Basecall_2D_000/BaseCalled_2D (group)
     Analyses/Basecall_2D_000/BaseCalled_2D/Alignment 
     Analyses/Basecall_2D_000/BaseCalled_2D/Fastq 
     Analyses/Basecall_2D_000/Configuration (group)
     Analyses/Basecall_2D_000/Configuration/aggregator (group)
     Analyses/Basecall_2D_000/Configuration/basecall_1d (group)
     Analyses/Basecall_2D_000/Configuration/basecall_2d (group)
     Analyses/Basecall_2D_000/Configuration/calibration_strand (group)
     Analyses/Basecall_2D_000/Configuration/components (group)
     Analyses/Basecall_2D_000/Configuration/general (group)
     Analyses/Basecall_2D_000/Configuration/hairpin_align (group)
     Analyses/Basecall_2D_000/Configuration/post_processing (group)
     Analyses/Basecall_2D_000/Configuration/post_processing.3000Hz (group)
     Analyses/Basecall_2D_000/Configuration/split_hairpin (group)
     Analyses/Basecall_2D_000/HairpinAlign (group)
     Analyses/Basecall_2D_000/HairpinAlign/Alignment 
     Analyses/Basecall_2D_000/Log 
     Analyses/Basecall_2D_000/Summary (group)
     Analyses/Basecall_2D_000/Summary/basecall_2d (group)
     Analyses/Basecall_2D_000/Summary/hairpin_align (group)
     Analyses/Basecall_2D_000/Summary/post_process_complement (group)
     Analyses/Basecall_2D_000/Summary/post_process_template (group)
     Analyses/Calibration_Strand_000 (group)
     Analyses/Calibration_Strand_000/Configuration (group)
     Analyses/Calibration_Strand_000/Configuration/aggregator (group)
     Analyses/Calibration_Strand_000/Configuration/basecall_1d (group)
     Analyses/Calibration_Strand_000/Configuration/basecall_2d (group)
     Analyses/Calibration_Strand_000/Configuration/calibration_strand (group)
     Analyses/Calibration_Strand_000/Configuration/components (group)
     Analyses/Calibration_Strand_000/Configuration/general (group)
     Analyses/Calibration_Strand_000/Configuration/hairpin_align (group)
     Analyses/Calibration_Strand_000/Configuration/post_processing (group)
     Analyses/Calibration_Strand_000/Configuration/post_processing.3000Hz (group)
     Analyses/Calibration_Strand_000/Configuration/split_hairpin (group)
     Analyses/Calibration_Strand_000/Log 
     Analyses/Calibration_Strand_000/Summary (group)
     Analyses/EventDetection_000 (group)
     Analyses/EventDetection_000/Configuration (group)
     Analyses/EventDetection_000/Configuration/abasic_detection (group)
     Analyses/EventDetection_000/Configuration/event_detection (group)
     Analyses/EventDetection_000/Configuration/hairpin_detection (group)
     Analyses/EventDetection_000/Reads (group)
     Analyses/EventDetection_000/Reads/Read_68 (group)
     Analyses/EventDetection_000/Reads/Read_68/Events 
     Analyses/Hairpin_Split_000 (group)
     Analyses/Hairpin_Split_000/Configuration (group)
     Analyses/Hairpin_Split_000/Configuration/aggregator (group)
     Analyses/Hairpin_Split_000/Configuration/basecall_1d (group)
     Analyses/Hairpin_Split_000/Configuration/basecall_2d (group)
     Analyses/Hairpin_Split_000/Configuration/calibration_strand (group)
     Analyses/Hairpin_Split_000/Configuration/components (group)
     Analyses/Hairpin_Split_000/Configuration/general (group)
     Analyses/Hairpin_Split_000/Configuration/hairpin_align (group)
     Analyses/Hairpin_Split_000/Configuration/post_processing (group)
     Analyses/Hairpin_Split_000/Configuration/post_processing.3000Hz (group)
     Analyses/Hairpin_Split_000/Configuration/split_hairpin (group)
     Analyses/Hairpin_Split_000/Log 
     Analyses/Hairpin_Split_000/Summary (group)
     Analyses/Hairpin_Split_000/Summary/split_hairpin (group)
     Sequences (group)
     Sequences/Meta (group)
     UniqueGlobalKey (group)
     UniqueGlobalKey/channel_id (group)
     UniqueGlobalKey/context_tags (group)
     UniqueGlobalKey/tracking_id (group)
#+end_example

